import classes from "./PriceList.module.css";

const PriceList = (props) => {
  let repairClutch = [
    {
      id: 1,
      title: "Замена сцепления(комплект)",
      price: "от 6000 ₽",
    },
    {
      id: 2,
      title: "Замена рабочего циллиндра сцепления",
      price: "от 630 ₽",
    },
    {
      id: 3,
      title: "Прокачка контура сцепления",
      price: "от 630 ₽",
    },
    {
      id: 4,
      title: "Замена главного циллиндра сцепления",
      price: "от 1500 ₽",
    },
    {
      id: 5,
      title: "С/у АКПП(МКПП)легкового моноприводного а/м",
      price: "от 6000 ₽",
    },
    {
      id: 6,
      title: "Сборка/разборка АКПП (МКПП) легкового моноприводного а/м",
      price: "от 7000 ₽",
    },
    {
      id: 7,
      title: "С/у АКПП (МКПП) полноприводного а/м",
      price: "от 8000 ₽",
    },
    {
      id: 8,
      title: "Сборка/разборка АКПП (МКПП) полноприводного а/м",
      price: "от 9000 ₽",
    },
    {
      id: 9,
      title: "Сборка/разборка АКПП (МКПП) тяжелого внедорожного а/м",
      price: "от 12000 ₽",
    },
    {
      id: 10,
      title: "С/у АКПП (МКПП) тяжелого внедорожного а/м",
      price: "от 13000 ₽",
    },
    {
      id: 11,
      title:
        "Ремонт ГБЦ без снятия ГБЦ (притирка клапанов + замена прокладок + замена маслосъемных колпачков)",
      price: "от 4000 ₽",
    },
    {
      id: 12,
      title: "Замена ГРМ (рядный ДВС одновальный SOHC)",
      price: "от 4500 ₽",
    },
    {
      id: 13,
      title: "Замена ГРМ (рядный ДВС двухвальный DOHC)",
      price: "от 6500 ₽",
    },
    {
      id: 14,
      title: "Замена ГРМ (V-образный ДВС одновальный SOHC)",
      price: "от 8000 ₽",
    },
    {
      id: 15,
      title: "Замена ГРМ (V-образный ДВС двухвальный DOHC)",
      price: "от 9000 ₽",
    },
    {
      id: 16,
      title: "Замена прокладки ГБЦ",
      price: "от 15000 ₽",
    },
    {
      id: 17,
      title: "Капитальный ремонт * ДВС (рядный ДВС 4-х циллиндровый)",
      price: "от 35000 ₽",
    },
    {
      id: 18,
      title: "Капитальный ремонт * ДВС (рядный ДВС 5-ти циллиндровый)",
      price: "от 45000 ₽",
    },
    {
      id: 19,
      title: "Капитальный ремонт * ДВС (рядный ДВС 6-ти циллиндровый)",
      price: "от 55000 ₽",
    },
    {
      id: 20,
      title:
        "Капитальный ремонт * ДВС (V-образный ДВС 6-ти, 8-ми циллиндровый)",
      price: "от 65000 ₽",
    },
  ];

  return repairClutch.map((elem) => (
    <div className={classes.info}>
      <h3>{elem.title}</h3>
      <span>{elem.price}</span>
    </div>
  ));
};
export default PriceList;
